kirim/app/Models/Point_model.php

SELECT `nama_ptk`, sum(nilai) as point
FROM `t_point`
JOIN `t_ptk` ON `t_ptk`.`id_ptk` = `t_point`.`id_ptk`
WHERE `id_jenis_ptk` = 1
AND `status_ptk` = 1
ORDER BY `point` DESC
 LIMIT 5
---
    public function getPointdosen()
    {
        return $this->db->table($this->table)
        ->select('nama_ptk, sum(nilai) as point')
        ->join('t_ptk', 't_ptk.id_ptk = t_point.id_ptk')
        ->where('id_jenis_ptk', 1)
        ->where('status_ptk', 1)
        ->orderBy('point', 'desc')
        ->limit(5)
        ->get()->getResultArray();

SELECT `nama_ptk`, sum(nilai) as point
FROM `t_point`
JOIN `t_ptk` ON `t_ptk`.`id_ptk` = `t_point`.`id_ptk`
WHERE `id_jenis_ptk` = 2
AND `status_ptk` = 1
ORDER BY `point` DESC
 LIMIT 5
---
    public function getPointkaryawan()
    {
        return $this->db->table($this->table)
        ->select('nama_ptk, sum(nilai) as point')
        ->join('t_ptk', 't_ptk.id_ptk = t_point.id_ptk')
        ->where('id_jenis_ptk', 2)
        ->where('status_ptk', 1)
        ->orderBy('point', 'desc')
        ->limit(5)
        ->get()->getResultArray();