kirim/app/Models/Shift_model.php

SELECT *
FROM `r_shift`
---
    public function getShift()
    {
        return $this->db->table($this->table)
        ->get()->getResultArray();