kirim/app/Views/home/home_admin.php

                                                            $builder_dsn = $db->table('t_ptk');
                                                            $builder_dsn->where('id_jenis_ptk', 1);
                                                            $builder_dsn->where('status_ptk', 1);
                                                            $all_dsn =  $builder_dsn->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_ptk`
WHERE `id_jenis_ptk` = 1
AND `status_ptk` = 1

                                                                    $builder_dsn_lk->where('id_jenis_ptk', 1);
                                                                    $builder_dsn_lk->where('status_ptk', 1);
                                                                    $builder_dsn_lk->where('kd_jenis_kelamin', 1);
                                                                    $all_dsn_lk =  $builder_dsn_lk->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_ptk`
WHERE `id_jenis_ptk` = 1
AND `status_ptk` = 1
AND `kd_jenis_kelamin` = 1

                                                                    $builder_dsn_pr->where('id_jenis_ptk', 1);
                                                                    $builder_dsn_pr->where('status_ptk', 1);
                                                                    $builder_dsn_pr->where('kd_jenis_kelamin', 2);
                                                                    $all_dsn_pr =  $builder_dsn_pr->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_ptk`
WHERE `id_jenis_ptk` = 1
AND `status_ptk` = 1
AND `kd_jenis_kelamin` = 2

                                                            $builder_kry = $db->table('t_ptk');
                                                            $builder_kry->where('id_jenis_ptk', 2);
                                                            $builder_kry->where('status_ptk', 1);
                                                            $all_kry =  $builder_kry->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_ptk`
WHERE `id_jenis_ptk` = 2
AND `status_ptk` = 1

                                                                    $builder_kry_lk->where('id_jenis_ptk', 2);
                                                                    $builder_kry_lk->where('status_ptk', 1);
                                                                    $builder_kry_lk->where('kd_jenis_kelamin', 1);
                                                                    $all_kry_lk =  $builder_kry_lk->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_ptk`
WHERE `id_jenis_ptk` = 2
AND `status_ptk` = 1
AND `kd_jenis_kelamin` = 1

                                                                    $builder_kry_pr->where('id_jenis_ptk', 2);
                                                                    $builder_kry_pr->where('status_ptk', 1);
                                                                    $builder_kry_pr->where('kd_jenis_kelamin', 2);
                                                                    $all_kry_pr =  $builder_kry_pr->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `t_ptk`
WHERE `id_jenis_ptk` = 2
AND `status_ptk` = 1
AND `kd_jenis_kelamin` = 2