apps/absensi/kirim/app/Models/Tapel_model.php

SELECT *
FROM `r_tapel`
---
    public function getTapel()
    {
        return $this->db->table($this->table)
        ->get()->getResultArray();