apps/absensi/kirim/app/Views/index/navbar.php

                <?php
                $db = \Config\Database::connect();
                $builder = $db->table('t_setting_aplikasi');
                $query =  $builder->get();
---
SELECT *
FROM `t_setting_aplikasi`