apps/absensi/kirim/app/Views/func.php

function jummasukbln($id_ptk,$bln) {
    //cek apakah ada absen masuk
    $db = \Config\Database::connect();
	$builder = $db->table('tweb_pegawai_hadir');
    $builder->where('ID_PEGAWAI', $id_ptk);
    $builder->where('STATUS', 0);
    $builder->where('MONTH(TANGGAL)', $bln);
    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tweb_pegawai_hadir`
WHERE `ID_PEGAWAI` = '1'
AND `STATUS` = 0
AND MONTH(TANGGAL) = '9'

function jumsakitbln($id_ptk,$bln) {
    //cek apakah ada absen sakit
    $db = \Config\Database::connect();
	$builder = $db->table('tweb_pegawai_absen');
    $builder->where('ID_PEGAWAI', $id_ptk);
    $builder->where('STATUS', 2);
    $builder->where('MONTH(TANGGAL_ABSEN)', $bln);
    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tweb_pegawai_absen`
WHERE `ID_PEGAWAI` = '1'
AND `STATUS` = 2
AND MONTH(TANGGAL_ABSEN) = '9'

function jumizinbln($id_ptk,$bln) {
    //cek apakah ada absen izin
    $db = \Config\Database::connect();
	$builder = $db->table('tweb_pegawai_absen');
    $builder->where('ID_PEGAWAI', $id_ptk);
    $builder->where('STATUS', 3);
    $builder->where('MONTH(TANGGAL_ABSEN)', $bln);
    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tweb_pegawai_absen`
WHERE `ID_PEGAWAI` = '1'
AND `STATUS` = 3
AND MONTH(TANGGAL_ABSEN) = '9'

function jumalphabln($id_ptk,$bln) {
    $thn = date('Y');
    $sum = 0;
    //jumlah hari di bulan terpilih
    $jumHari = cal_days_in_month(CAL_GREGORIAN, $bln, $thn);
    for($i=1;$i<=$jumHari;$i++){
        $tanggal = date('Y').'-'.date('m').'-'.$i;
        $namahari = date('l', strtotime($tanggal));
        if(harilibur($namahari)==2){
            $sum++;
        }
    }
    $harilibur = $sum;
    $harimasuk = $jumHari-$harilibur;

    $db = \Config\Database::connect();
	$builder = $db->table('tweb_pegawai_hadir');
    $builder->where('ID_PEGAWAI', $id_ptk);
    $builder->where('STATUS', 0);
    $builder->where('MONTH(TANGGAL)', $bln);
    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tweb_pegawai_hadir`
WHERE `ID_PEGAWAI` = '1'
AND `STATUS` = 0
AND MONTH(TANGGAL) = '9'

function jumterlambatbln($id_ptk,$bln) {
    $db = \Config\Database::connect();
	$builder = $db->table('tweb_pegawai_hadir');
    $builder->where('ID_PEGAWAI', $id_ptk);
    $builder->where('STATUS', 0);
    $builder->where('MONTH(TANGGAL)', $bln);
    $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tweb_pegawai_hadir`
WHERE `ID_PEGAWAI` = '1'
AND `STATUS` = 0
AND MONTH(TANGGAL) = '9'