app/Controllers/Cpanel.php

    public function process()
    {

        $db = \Config\Database::connect();

        $email = $this->request->getVar('email');
        $pass = $this->request->getVar('password');

        $id_tapel = $this->request->getVar('tapel');
        if($id_tapel==0){
            session()->setFlashdata('error', 'Tapel belum di pilih');
            return redirect()->back();
        }

        //merubah id tapel ke nama tapel
        $builder_tap = $db->table('r_tapel');
        $builder_tap -> where('id_tapel', $id_tapel);
        $query_tap =  $builder_tap->get();
        $tapel = $query_tap->getRow();


        $builder = $db->table('t_user');
        $builder -> where('username', $email);
        $query =  $builder->get();
---
SELECT *
FROM `t_user`
WHERE `username` = 'andi@gmail.com'