app/Controllers/Export.php

            function jampulang($id_ptk,$tgl) {
                //cek apakah ada absen masuk
                $db = \Config\Database::connect();
                $builder = $db->table('tweb_pegawai_hadir');
                $builder->where('ID_PEGAWAI', $id_ptk);
                $builder->where('STATUS', 1);
                $builder->where('TANGGAL', $tgl);
                $all =  $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tweb_pegawai_hadir`
WHERE `ID_PEGAWAI` = '1'
AND `STATUS` = 0
AND MONTH(TANGGAL) = '09'